// 정리

// < 타입 하나를 만들때 필요한 문법들 (class 문법) >
// 1. 구조체 안에 함수를 넣자
// 2. 접근지정자 ( private, pubic )	
//    => /* 시험문제 : 다음중 외부에서 접근할수 없게 하는 접근 지정자는? private */
// 3. 생성자, 소멸자 
//    => /* 시험문제 : 다음중 생성자에 대한 설명으로 틀린것은? 생성자를 하나도 만들지 않으면 생성자는 없다 (false) */
// 4. 멤버 초기화 리스트
//----------------------------------------------------------------------------------------------------------------
// 5. static member
// 6. const member function
// 7. this, 참조를 반환하는 이유
// 8. 복사 생성자
//---------------------------------------------------------------------------------------- 클래스 하나에 대한 문법들
// 
// < 여러개의 클래스를 사용해서 객체지향으로 디자인 하는 방법과 문법들 >
// 1. 상속 ! - 7~8 시간
// 2. 연산자 재정의, STL, 예외 - 7~8시간